yaml_content = (
    "nc: 3\n"
    "\n"
    "scales:\n"
    "  s: [0.50, 0.50, 1024]\n"
    "\n"
    "backbone:\n"
    "  - [-1, 1, Conv,   [64, 3, 2]]\n"
    "  - [-1, 1, Conv,   [128, 3, 2]]\n"
    "  - [-1, 2, C3k2,   [256, False, 0.25]]\n"
    "  - [-1, 1, Conv,   [256, 3, 2]]\n"
    "  - [-1, 2, C3k2,   [512, False, 0.25]]\n"
    "  - [-1, 1, Conv,   [512, 3, 2]]\n"
    "  - [-1, 2, C3k2,   [512, True]]\n"
    "  - [-1, 1, Conv,   [1024, 3, 2]]\n"
    "  - [-1, 2, C3k2,   [1024, True]]\n"
    "  - [-1, 1, SPPF,   [1024, 5]]\n"
    "  - [-1, 2, C2PSA,  [1024]]\n"
    "  - [-1, 1, FCBAM,  [1024]]\n"
    "\n"
    "head:\n"
    "  - [-1, 1, nn.Upsample, [None, 2, \"nearest\"]]\n"
    "  - [[-1, 6], 1, Concat, [1]]\n"
    "  - [-1, 2, C3k2,        [512, False]]\n"
    "  - [-1, 1, FCBAM,       [512]]\n"
    "  - [-1, 1, nn.Upsample, [None, 2, \"nearest\"]]\n"
    "  - [[-1, 4], 1, Concat, [1]]\n"
    "  - [-1, 2, C3k2,        [256, False]]\n"
    "  - [-1, 1, FCBAM,       [256]]\n"
    "  - [-1, 1, Conv,        [256, 3, 2]]\n"
    "  - [[-1, 15], 1, Concat,[1]]\n"
    "  - [-1, 2, C3k2,        [512, False]]\n"
    "  - [-1, 1, Conv,        [512, 3, 2]]\n"
    "  - [[-1, 11], 1, Concat,[1]]\n"
    "  - [-1, 2, C3k2,        [1024, True]]\n"
    "  - [[19, 22, 25], 1, Detect, [nc]]\n"
)

with open('yolov11s_fcbam.yaml', 'w') as f:
    f.write(yaml_content)

with open('yolov11s_fcbam.yaml', 'r') as f:
    print(f.read())
