yaml_content = (
    "nc: 3\n"
    "\n"
    "scales:\n"
    "  s: [0.50, 0.50, 1024]\n"
    "\n"
    "backbone:\n"
    "  - [-1, 1, Conv,   [64, 3, 2]]\n"          # layer 0  - P1/2  - stem
    "  - [-1, 1, Conv,   [128, 3, 2]]\n"          # layer 1  - P2/4
    "  - [-1, 2, C3k2,   [256, False, 0.25]]\n"   # layer 2  - 256ch
    "  - [-1, 1, Conv,   [256, 3, 2]]\n"          # layer 3  - P3/8
    "  - [-1, 2, C3k2,   [512, False, 0.25]]\n"   # layer 4  - P3 skip connection to neck
    "  - [-1, 1, Conv,   [512, 3, 2]]\n"          # layer 5  - P4/16
    "  - [-1, 2, C3k2,   [512, True]]\n"          # layer 6  - P4 skip connection to neck
    "  - [-1, 1, Conv,   [1024, 3, 2]]\n"         # layer 7  - P5/32
    "  - [-1, 2, C3k2,   [1024, True]]\n"         # layer 8
    "  - [-1, 1, SPPF,   [1024, 5]]\n"            # layer 9  - spatial pyramid pooling
    "  - [-1, 2, C2PSA,  [1024]]\n"               # layer 10 - deepest backbone feature
    "  - [-1, 1, FCBAM,  [1024]]\n"               # layer 11 - FCBAM-1 on P5 - yawn focus
    "\n"
    "head:\n"
    "  - [-1, 1, nn.Upsample, [None, 2, \"nearest\"]]\n"   # layer 12 - upsample to 40x40
    "  - [[-1, 6], 1, Concat, [1]]\n"                      # layer 13 - concat P4 backbone skip
    "  - [-1, 2, C3k2,        [512, False]]\n"             # layer 14 - fuse P4+P5
    "  - [-1, 1, FCBAM,       [512]]\n"                    # layer 15 - FCBAM-2 on P4 - face context
    "  - [-1, 1, nn.Upsample, [None, 2, \"nearest\"]]\n"   # layer 16 - upsample to 80x80
    "  - [[-1, 4], 1, Concat, [1]]\n"                      # layer 17 - concat P3 backbone skip
    "  - [-1, 2, C3k2,        [256, False]]\n"             # layer 18 - fuse P3+P4
    "  - [-1, 1, FCBAM,       [256]]\n"                    # layer 19 - FCBAM-3 on P3 - eye focus
    "  - [-1, 1, Conv,        [256, 3, 2]]\n"              # layer 20 - downsample to 40x40
    "  - [[-1, 15], 1, Concat,[1]]\n"                      # layer 21 - concat post-FCBAM P4
    "  - [-1, 2, C3k2,        [512, False]]\n"             # layer 22 - P4 output for detect head
    "  - [-1, 1, Conv,        [512, 3, 2]]\n"              # layer 23 - downsample to 20x20
    "  - [[-1, 11], 1, Concat,[1]]\n"                      # layer 24 - concat post-FCBAM P5
    "  - [-1, 2, C3k2,        [1024, True]]\n"             # layer 25 - P5 output for detect head
    "  - [[19, 22, 25], 1, Detect, [nc]]\n"                # layer 26 - detect P3, P4, P5
)

with open('yolov11s_fcbam.yaml', 'w') as f:
    f.write(yaml_content)

with open('yolov11s_fcbam.yaml', 'r') as f:
    print(f.read())
